:PROPERTIES:
#+TITLE: Scratch
#+OPTIONS: toc:nil todo:nil
#+FILETAGS: temporary
:END:

*** generator
#+name: gen-command
#+header: :var stamp_op="-channel A -fx a*0.7"
#+begin_src python :var v_count=2 :var h_count=2 :var h_max=500 :var v_max=500 :var stamp_name="m.png"
  from random import randint

  stamp_size=100

  # this depends on the image to be stamped on
  hofs_max=int((stamp_size/2) * 0.7)
  vofs_max=int((stamp_size/2) * 0.5)

  # h_step = int(stamp_size * 0.8)
  # v_step = int(stamp_size * 0.7)
  h_step = int(h_max / h_count)
  v_step = int(v_max / v_count)

  cmd=""

  for v in range(0, int(v_max), v_step):
      for h in range(0, int(h_max), h_step):
          v_pos = v + randint(-vofs_max, vofs_max)
          h_pos = h + randint(-hofs_max, hofs_max)
          rot = randint(0, 360)

          cmd+=f"( ( {stamp_name} {stamp_op}  ) -rotate {rot} -geometry {stamp_size}x{stamp_size}^{h_pos:+}{v_pos:+} ) -composite "

  return cmd
#+end_src

#+RESULTS: gen-command
: ( ( m.png -channel A -fx a*0.7  ) -geometry 100x100^-7-7 ) -composite ( ( m.png -channel A -fx a*0.7  ) -geometry 100x100^+249+21 ) -composite ( ( m.png -channel A -fx a*0.7  ) -geometry 100x100^-16+269 ) -composite ( ( m.png -channel A -fx a*0.7  ) -geometry 100x100^+266+274 ) -composite

*** generator
#+name: gen-command-const-density
#+header: :var stamp_op="-channel A -fx a*0.7"
#+header: :var stamp_h=275 :var stamp_w=163
#+begin_src python :var v_count=2 :var h_count=2 :var h_max=500 :var v_max=500 :var stamp_name="m.png"
    from random import randint

    # this depends on the image to be stamped on
    h_ofs_max=int((stamp_h/2) * 0.7)
    v_ofs_max=int((stamp_w/2) * 0.5)

    h_step = int(stamp_h * 1.5)
    v_step = int(stamp_w * 1.5)

    cmd=""

    for v in range(0, int(v_max), v_step):
        for h in range(0, int(h_max), h_step):
            v_pos = v + randint(-v_ofs_max, v_ofs_max)
            h_pos = h + randint(-h_ofs_max, h_ofs_max)

            cmd+=f"( ( {stamp_name} {stamp_op}  ) -geometry {stamp_h}x{stamp_w}^{h_pos:+}{v_pos:+} ) +repage -composite "

    return cmd
#+end_src

#+RESULTS: gen-command-const-density
: ( ( m.png -channel A -fx a*0.7  ) -geometry 275x163^+54+14 ) -composite ( ( m.png -channel A -fx a*0.7  ) -geometry 275x163^+442+6 ) -composite ( ( m.png -channel A -fx a*0.7  ) -geometry 275x163^+25+216 ) -composite ( ( m.png -channel A -fx a*0.7  ) -geometry 275x163^+398+214 ) -composite ( ( m.png -channel A -fx a*0.7  ) -geometry 275x163^-43+516 ) -composite ( ( m.png -channel A -fx a*0.7  ) -geometry 275x163^+401+465 ) -composite

